# 3'. Задайте последовательность чисел. Напишите программу, 
# которая выведет список неповторяющихся элементов исходной последовательности.

def onceTime(mas):
    print(set(mas))


row = [3, 4, 87, 45, 8, 4, 9, 45, 87]
onceTime(row)